GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
#include <Arduino.h>
#include <ESP32Servo.h> // ONLY LIBRARY NECESARY FOR ESC 
// #include <BluetoothSerial.h>
#include <PID.h>
#include <esp_now.h>
#include <WiFi.h>
#include <array>
#include <vector>

// MARK: Function prototypes 
// because c++ is a liar

void stopAllDriveMotors();
void setSpeed(int speedA, int speedB);
void updateEncoderLeft();
void updateEncoderRight();
void driveDistance(float distance, int speed);
void turnDegrees(float degrees, int speed);
void forwards();
void backwards();
void left();
void right();
long readEncoderLeft();
long readEncoderRight();
long readEncoderGantry();
long distanceToEncoderTicks(float distanceMm);
int pidOutputToSpeed(double output, long error, int maxSpeed);
bool runToEncoderTargets(long leftTargetTicks, long rightTargetTicks, int speed);
void setGantryPower(int power);
void updateEncoderGantry();
bool setGantryPosition(int targetPos, int maxSpeed);
int readEncoderExtruder();

// MARK: Pinout

// Left Motor Pins
const int PWMR = 23; 
const int R1 = 21; // const int L1 = 22;
const int R2 = 22; // const int L2 = 21;

// Right Motor Pins
const int PWML = 19; 
const int L1 = 18;
const int L2 = 5;

// Gantry Motor Pins
const int ENI = 25;
const int Gantry1 = 26;
const int Gantry2 = 27; 

// Extruder Motor Pins
const int PWM_EXT = 14;
const int EXT1 = 4;
const int EXT2 = 12;

// Encoder Connections
const int ENCAFL = 34; // Encoder A pin for Front Left Motor
const int ENCBFL = 35; // Encoder B pin for Front Left Motor

const int ENCAFR = 32; // Encoder A pin for Front Right Motor
const int ENCBFR = 33; // Encoder B pin for Front Right Motor

const int ENCGANA = 36; // 1st Encoder Pin for Gantry
const int ENCGANB = 39; // 2nd Encoder Pin for Gantry 

const int ENCEXTA = 2;
const int ENCEXTB = 15;


byte servoPin = 13; // signal pin for the ESC.

Servo servo;
PID pidController = PID();
PID leftDrivePID = PID();
PID rightDrivePID = PID();
PID pidControllerGantry = PID();
PID pidControllerExt = PID();
// BluetoothSerial BS;

// MARK: Variables

float angle = 0;

// Drivetrain PID values
double kP = 0.45;
double kI = 0.0035; 
double kD = 0.0; // we dont need a big d

double kP_gantry = 0.5;
double kI_gantry = 0;
double kD_gantry = 0;

double kP_ext = 1;
double kI_ext = 0;
double kD_ext = 0;

float cx = 0.85;
float cy = 0.2;
float ax[5] = {0.1,0.3,0.5,0.7,0.9};
float ay[5] = {0.2, 0.25, 0.45, 0.7, 0.8};

bool autonomous = false;
bool prevButton4State = false;
bool prevButton5State = false;

volatile long encoderValueLeft = 0;
volatile long encoderValueRight = 0;
volatile long encoderValueGantry = 0;
volatile long encoderValueExtruder = 0;

int targetPositionRight;
int targetPositionLeft;

int targetPositionGantry;
int minGantryPosition = 0;
int maxGantryPosition = 38811;
float gantryTicksPerMM = 9996 / 185.7;
bool hasZeroedGantry = false;

int targetPositionExtruder;
int minExtruderPosition = 0;
int maxExtruderPosition = 0;
bool hasZeroedExtruder;

const float wheelDiameter = 45.0; // mm
const long ticksPerRotation = 7*298; 
const float wheelCircumference = wheelDiameter * PI;
const float turnSlipCompensation = 1.15; // This is a fudge factor to account for the fact that the robot doesn't turn perfectly in place
const float trackWidth = 350.0; // mm
int movementSpeed = 255; // Speed for driving forward/backward (0-255)
const float rpmAtMaxSpeed = 100; // Maximum RPM of the motor at full speed - TODO
const float turnSpeed = 200; // Speed for turning left/right (0-255) - TODO
const int encoderToleranceTicks = 15;
const int minimumPIDSpeed = 55;
const unsigned long movementLoopDelayMs = 10;

const float cameraFOVWidthMM = 95.0; // Width of the camera's field of view in millimeters 
const float cameraFOVHeightMM = 70.0; // Height of the camera's field of view in millimeters 

long fixedExtrudeTicks = 1000;
int pwrExt = 100;
int pwrGantry = 100;

// MARK: Structs

// Structure example to receive data
// Must match the sender structure
typedef struct struct_message {
int vy1;
int vy2;
int vy3;
int vx2;
bool button1;
bool button2;
bool button3;
bool button4;
bool button5;
} struct_message;

// point :)
typedef struct point {
  float x;
  float y;
} point;

bool runToEncoderTargetsWithGantry(long leftTargetTicks, long rightTargetTicks, long gantryTargetTicks, int speed);
std::array<point, 5> getCurrentOrderedCoordinateArray();
bool driveForwardsAndTrackCrack();
void driveForwardsAndUpdateCoordinates(float distance, std::vector<point>* coordinates, float gantryTarget);

// MARK: ESP-NOW Comms



// Create a struct_message called joystickData
struct_message joystickData = {1950, 1950, 1950, 1950, true, true, true};

// Callback function that will be executed when data is received
void OnDataRecv(const uint8_t * mac, const uint8_t *incomingData, int len) {
  memcpy(&joystickData, incomingData, sizeof(joystickData));
  // Serial.print("Bytes received: "); // Serial.println(len);
  // Serial.print("VY1 ");
  // Serial.println(joystickData.vy1);
  // Serial.print("VY2 ");
  // Serial.println(joystickData.vy2);
  // Serial.print("VY3 ");
  // Serial.println(joystickData.vy3);
  // Serial.print("VX2 ");
  // Serial.println(joystickData.vx2);
  // Serial.print("Button1: ");
  // Serial.println(joystickData.button1);
  // Serial.print("Button2: ");
  // Serial.println(joystickData.button2);
  // Serial.print("Button3: ");
  // Serial.print(joystickData.button3);
  // Serial.print("Button4: ");
  // Serial.println(joystickData.button4);
  // Serial.print("Button5: ");
  // Serial.println(joystickData.button5);
  
  // Serial.println();
}

// MARK: Movement Calculations

float RPM(float speed) {
  return rpmAtMaxSpeed * (speed / 255.0);
}

float mmPerSecond(float speed) {
  return (RPM(speed) * wheelCircumference) / 60;
}

float degreesPerSecond(float speed) {
  return (2 * mmPerSecond(speed) / trackWidth) * 180 / PI;
}

// MARK: Encoder Functions

long readEncoderLeft() {
  // noInterrupts();
  long value = encoderValueLeft;
  // interrupts();
  return value;
}

long readEncoderRight() {
  // noInterrupts();
  long value = encoderValueRight;
  // interrupts();
  return value;
}

long distanceToEncoderTicks(float distanceMm) {
  Serial.print("Calculation: (");
  Serial.print(distanceMm);
  Serial.print(" / ");
  Serial.print(wheelCircumference);
  Serial.print(" ) * ");
  Serial.print(ticksPerRotation);
  return lround((distanceMm / wheelCircumference) * ticksPerRotation);
}

