GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
//       ax[0] = cxData.toFloat();
//       ax[1] = x1Data.toFloat();
//       ax[2] = x2Data.toFloat();
//       ax[3] = x3Data.toFloat();
//       ax[4] = x4Data.toFloat();

//       ay[0] = y1Data.toFloat();
//       ay[1] = y2Data.toFloat();
//       ay[2] = y3Data.toFloat();
//       ay[3]= y4Data.toFloat();
//       ay[4] = y4Data.toFloat();
//     }
//   }
// }

// MARK: Setup
void setup() {

  Serial.begin(115200);
  // BS.begin("ARCS");

  // Set all control pins to outputs
  pinMode(PWML, OUTPUT);
  pinMode(L1, OUTPUT);
  pinMode(L2, OUTPUT);
  pinMode(PWMR, OUTPUT);
  pinMode(R1, OUTPUT);
  pinMode(R2, OUTPUT);
  pinMode(Gantry1, OUTPUT);
  pinMode(Gantry2, OUTPUT);
  pinMode(ENI, OUTPUT);
  pinMode(PWM_EXT, OUTPUT);
  pinMode(EXT1, OUTPUT);
  pinMode(EXT2, OUTPUT);

  // Set all encoder pins to inputs
  pinMode(ENCAFL, INPUT);
  pinMode(ENCBFL, INPUT);
  pinMode(ENCAFR, INPUT);
  pinMode(ENCBFR, INPUT);
  pinMode(ENCGANA, INPUT);
  pinMode(ENCGANB, INPUT);
  pinMode(ENCEXTA, INPUT);
  pinMode(ENCEXTB, INPUT);

  // Set encoder pins to interrupts
  attachInterrupt(digitalPinToInterrupt(ENCAFL), updateEncoderLeft, RISING);

  attachInterrupt(digitalPinToInterrupt(ENCAFR), updateEncoderRight, RISING);

  attachInterrupt(digitalPinToInterrupt(ENCGANA), updateEncoderGantry, RISING);

  attachInterrupt(digitalPinToInterrupt(ENCEXTA), updateEncoderExtruder, RISING);
  
  servo.attach(servoPin);
  servo.writeMicroseconds(1100); // send "stop" signal to ESC. Also necessary to arm the ESC.
  Serial.println("ESC TEST PREP");

  // Turn off motors initially
  stopAllDriveMotors();

  // Set device as a Wi-Fi Station
  WiFi.mode(WIFI_STA);

  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println("Error initializing ESP-NOW");
    return;
  }
  
  // Once ESPNow is successfully Init, we will register for recv CB to
  // get recv packer info
  esp_now_register_recv_cb(esp_now_recv_cb_t(OnDataRecv));
  
}

// MARK: Loop
long encoderStartLeft = 0;
long encoderStartRight = 0;
long encoderEndLeft = 0;
long encoderEndRight = 0;
float rpmLeft = 0.0;
float rpmRight = 0.0;
// int pwmValue = 255;

const int edfPowerMin = 1100;
const int edfPowerMax = 1900;
const int edfJoystickDefault = 1950;
int edfPower = edfPowerMin;
int edfIncrementResolution = 10;
int edfIncrement = 0;
int joystickDeadzone = 100;
bool killEverything = false;
bool joystickConnected = true;

void loop() {
  // setGantryPosition(0, 255);
  // setGantryPosition(-50, 255);
  // Serial.println(readEncoderExtruder());
  // setExtruderPower(100);
  // setExtruderPositionTicks(1000, 255);
  // Serial.println("HIHIHIHIHIHI");
  // delay(2000);
  // homeGantryPosition();
  // while(true){}
  // while(true){}
  // setGantryPower(100);
  // updateVision();
  // // // updateVisionArray();
  // // Serial.println("CX: " +String(cx));
  // // Serial.println("CY: " + String(cy));

  // if(BS.available() > 0){
  //   Serial.println("Starting Auto");
  //   crackAuto();
  // }
  // Serial.println(ax);

  // delay(100);
  // turnDegrees(180, 255);
  // driveDistance(45*PI, 255);
  // forwards();
  // homeGantryPosition();
  // driveToCrackCenter(0.5, 0.5);
  // gantryAlign(0.5);
  // crackAuto();
  // while (true){}
  // forwards();
  // turnDegrees(90, 200);
  // while (true) {}

  // setGantryPosition(maxGantryPosition/2, 255);
  // crackAuto();
  // while (true) {}
  // Serial.println("Gantry Position: " + String(encoderValueGantry));

  // setGantryPower(0);
  // delay(1000);

  // testAutoDrive();

  // MARK: Joystick Code

  
  
  
  int leftVal=map(joystickData.vy1, 0, 4095, -255, 255);
  int rightVal=map(joystickData.vy3, 0, 4095, -255, 255);
  int gantryVal=map(joystickData.vx2, 0, 4095, -255, 255);
  int extVal = map(joystickData.vy2, 0, 4095, -255, 255);
  
  if (abs(leftVal) < joystickDeadzone) {
    leftVal = 0;
  }
  if (abs(rightVal) < joystickDeadzone) {
    rightVal = 0;
  }
  if (abs(gantryVal) < joystickDeadzone) {
    gantryVal = 0;
  }
  if (abs(extVal) < joystickDeadzone) {
    extVal = 0;
  }
  bool button3State=joystickData.button3;
  bool button2State=joystickData.button2;
  bool button1State=joystickData.button1;
  bool button4State=joystickData.button4;
  bool button5State=joystickData.button5;

  edfIncrement = 0;
  if (joystickData.vy2 < edfJoystickDefault) {
    edfIncrement=map(joystickData.vy2, 0, edfJoystickDefault-200, -edfIncrementResolution, 0);
  } else {
    edfIncrement=map(joystickData.vy2, edfJoystickDefault+100, 4095, 0, edfIncrementResolution);
  }

  gantryVal = -gantryVal;
  leftVal = -leftVal;
  rightVal = -rightVal;

  edfIncrement = -edfIncrement;
  edfIncrement /= edfIncrementResolution; // Normalize to -1 to 1
  edfIncrement *= 3;
  if (button1State == 0) {
    killEverything = false;
    // hasZeroedGantry = true;
    autonomous = false;
  } else if (button3State == 0) {
    killEverything = true;
  }
  if (killEverything || !joystickConnected) {
    edfPower = edfPowerMin;
    servo.writeMicroseconds(edfPower); // output to edfs
    stopAllDriveMotors();
    analogWrite(ENI, 0);
    setExtruderPower(0);
  } else {
    if (button2State == 0) {
      edfPower += edfIncrement;
      edfPower = constrain(edfPower, edfPowerMin, edfPowerMax);
      servo.writeMicroseconds(edfPower); // output to edfs
    } else {
      setExtruderPower(extVal);
    }

    // Serial.print("Setting Speed");
    setSpeed(leftVal, rightVal);
    setGantryPower(gantryVal);

  }
    
  // Serial.println(String(encoderValueGantry));
  // Serial.println(encoderValueLeft);
  Serial.print(" EDF Increment: ");
  Serial.print(edfIncrement);
  Serial.print(" EDF Power: ");
  Serial.print(edfPower);
  Serial.print(" Left Val: ");
  Serial.print(leftVal);
  Serial.print(" Right Val: ");
  Serial.print(rightVal);
  Serial.print(" Gantry Val: ");
  Serial.print(gantryVal);
  Serial.print(" Extruder Val: ");
  Serial.print(extVal);
  Serial.print(" Kill Everything: ");
  Serial.print(killEverything);
  Serial.println();
  
  // Serial.println(encoderValueLeft + " hello " + encoderValueRight); // LINE OF DOOOOOOOOOOOOOOOOOOOMMMMMMMMMMM ONLY UNCOMMENT IN CASE OF EMERGENCY

  // driveDistance(700, 255);

  // Serial.print(String(encoderValueLeft));
  // Serial.print(", ");
  // Serial.print(String(encoderValueRight));
  // Serial.print(", ");
  // Serial.println(String(encoderValueGantry));

