GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
  // digitalWrite(Gantry1, HIGH);
  // digitalWrite(Gantry2, LOW);
  // analogWrite(ENI, 100);

  // if (BS.available() > 0) {
  //   String rawData = Serial.readStringUntil('\n');
  //   rawData.trim();
  //   if (rawData.length() > 0) {
  //     int cxIndex = rawData.indexOf("cx");
  //     int cyIndex = rawData.indexOf("cy");
  //     int xIndex = rawData.indexOf("x1");
  //     String xData = rawData.substring(cxIndex + 4, cyIndex - cxIndex - 3);
  //     String yData = rawData.substring(cyIndex + 4, xIndex - cyIndex - 3);
  //     cx = xData.toFloat();
  //     cy = yData.toFloat();
  //   Serial.println(rawData);
  //   }
  // }

  // if(button4State == LOW && prevButton4State == HIGH){
  //   autonomous = true;
  //   followPath(ax, ay);
  //   autonomous = false;
  //   // button4State = prevButton4State;
  // }
  // prevButton4State = button4State;

  // if(button5State == LOW && prevButton5State == HIGH){
  //   gantryAlign(cx);
  //   button5State = prevButton5State;
  // }
  // prevButton5State = button4State;

  // Serial.print(String((ENCAFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCBFR)));
  // Serial.print(", ");
  // Serial.print(String(digitalRead(ENCAFL)));
  // Serial.print(", ");
  // Serial.println(String(digitalRead(ENCBFL)));
}

// MARK: New Tracking Code

// const float invalidTrackingCoordinateMM = -1000000.0;

// bool runToEncoderTargetsWithGantry(long leftTargetTicks, long rightTargetTicks, long gantryTargetTicks, int speed) {
//   int maxSpeed = constrain(abs(speed), 0, 255);
//   if (maxSpeed == 0 || (leftTargetTicks == 0 && rightTargetTicks == 0 && gantryTargetTicks == 0)) {
//     stopAllDriveMotors();
//     stopGantry();
//     return true;
//   }

//   long startLeft = readEncoderLeft();
//   long startRight = readEncoderRight();
//   long startGantry = readEncoderGantry();
//   targetPositionLeft = startLeft + leftTargetTicks;
//   targetPositionRight = startRight + rightTargetTicks;
//   targetPositionGantry = startGantry + gantryTargetTicks;

//   Serial.print("[TRACK MOVE] leftTicks=");
//   Serial.print(leftTargetTicks);
//   Serial.print(" rightTicks=");
//   Serial.print(rightTargetTicks);
//   Serial.print(" gantryTicks=");
//   Serial.print(gantryTargetTicks);
//   Serial.print(" maxSpeed=");
//   Serial.println(maxSpeed);

//   leftDrivePID.Init(kP, kI, kD);
//   rightDrivePID.Init(kP, kI, kD);
//   pidControllerGantry.Init(kP_gantry, kI_gantry, kD_gantry);

//   float longestDriveDistanceMm = (max(abs(leftTargetTicks), abs(rightTargetTicks)) / (float)ticksPerRotation) * wheelCircumference;
//   float gantryDistanceMm = abs(gantryTargetTicks) / gantryTicksPerMM;
//   float longestDistanceMm = max(longestDriveDistanceMm, gantryDistanceMm);
//   unsigned long timeoutMs = (unsigned long)((longestDistanceMm / mmPerSecond(maxSpeed)) * 3000.0) + 1000;
//   unsigned long startTime = millis();

//   while (true) {
//     long currentLeft = readEncoderLeft();
//     long currentRight = readEncoderRight();
//     long currentGantry = readEncoderGantry();
//     long leftError = targetPositionLeft - currentLeft;
//     long rightError = targetPositionRight - currentRight;
//     long gantryError = targetPositionGantry - currentGantry;

//     bool leftAtTarget = abs(leftError) <= encoderToleranceTicks;
//     bool rightAtTarget = abs(rightError) <= encoderToleranceTicks;
//     bool gantryAtTarget = abs(gantryError) <= encoderToleranceTicks;

//     // Serial.print("Left Error: ");
//     // Serial.print(leftError);
//     // Serial.print(", Right Error: ");
//     // Serial.print(rightError);
//     // Serial.print(", Left Target: ");
//     // Serial.print(targetPositionLeft);   
//     // Serial.print(", Right Target: ");
//     // Serial.print(targetPositionRight);
//     // Serial.print(", Left Current: ");
//     // Serial.print(currentLeft);
//     // Serial.print(", Right Current: ");
//     // Serial.print(currentRight);

//     if (leftAtTarget && rightAtTarget && gantryAtTarget) {
//       stopAllDriveMotors();
//       stopGantry();
//       Serial.print("[TRACK MOVE DONE] left=");
//       Serial.print(currentLeft);
//       Serial.print(" right=");
//       Serial.print(currentRight);
//       Serial.print(" gantry=");
//       Serial.println(currentGantry);
//       return true;
//     }

//     if (millis() - startTime > timeoutMs) {
//       stopAllDriveMotors();
//       stopGantry();
//       Serial.print("[TRACK MOVE TIMEOUT] leftError=");
//       Serial.print(leftError);
//       Serial.print(" rightError=");
//       Serial.print(rightError);
//       Serial.print(" gantryError=");
//       Serial.println(gantryError);
//       return false;
//     }

//     leftDrivePID.UpdateError(leftError);
//     rightDrivePID.UpdateError(rightError);
//     pidControllerGantry.UpdateError(gantryError);
//     // Serial.print(", Left P: ");
//     // Serial.print(leftDrivePID.p_error);
//     // Serial.print(", Left I: ");
//     // Serial.print(leftDrivePID.i_error);
//     // Serial.print(", Left D: ");
//     // Serial.print(leftDrivePID.d_error);
//     // Serial.print(", Right P: ");
//     // Serial.print(rightDrivePID.p_error);
//     // Serial.print(", Right I: ");
//     // Serial.print(rightDrivePID.i_error);
//     // Serial.print(", Right D: ");
//     // Serial.println(rightDrivePID.d_error);
//     double leftOutput = leftDrivePID.TotalError();
//     double rightOutput = rightDrivePID.TotalError();
//     double gantryOutput = pidControllerGantry.TotalError();

//     // Serial.print(", Left Output: ");
//     // Serial.print(leftOutput);
//     // Serial.print(", Right Output: ");
//     // Serial.println(rightOutput);

//     int leftSpeed = leftAtTarget ? 0 : pidOutputToSpeed(leftOutput, leftError, maxSpeed);
//     int rightSpeed = rightAtTarget ? 0 : pidOutputToSpeed(rightOutput, rightError, maxSpeed);
//     int gantrySpeed = gantryAtTarget ? 0 : pidOutputToSpeed(gantryOutput, gantryError, maxSpeed);

//     // Serial.print("[TRACK MOVE LOOP] leftError=");
//     // Serial.print(leftError);
//     // Serial.print(" rightError=");
//     // Serial.print(rightError);
//     // Serial.print(" gantryError=");
//     // Serial.print(gantryError);
//     // Serial.print(" leftSpeed=");
//     // Serial.print(leftSpeed);
//     // Serial.print(" rightSpeed=");
//     // Serial.print(rightSpeed);
//     // Serial.print(" gantrySpeed=");
//     // Serial.println(gantrySpeed);

