GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
//     if (leftTargetTicks == -rightTargetTicks) {
//       // If turning, ensure both motors are moving at the same speed
//       setSpeed(leftSpeed, -leftSpeed);
//       // Serial.print("Output Speed:");
//       // Serial.println(leftSpeed);
//     } else {
//       setSpeed(leftSpeed, rightSpeed);
//     }
//     setGantryPower(gantrySpeed);
//     delay(movementLoopDelayMs);
//   }
// }

// float parseVisionCoordinate(String rawData, String key) {
//   int keyIndex = rawData.indexOf(key);
//   if (keyIndex < 0) {
//     return -1.0;
//   }

//   int valueStart = keyIndex + key.length();
//   while (valueStart < rawData.length()) {
//     char currentChar = rawData.charAt(valueStart);
//     if (currentChar == '-' || currentChar == '.' || (currentChar >= '0' && currentChar <= '9')) {
//       break;
//     }
//     valueStart++;
//   }

//   int valueEnd = valueStart;
//   if (valueEnd < rawData.length() && rawData.charAt(valueEnd) == '-') {
//     valueEnd++;
//   }
//   while (valueEnd < rawData.length()) {
//     char currentChar = rawData.charAt(valueEnd);
//     if (currentChar != '.' && (currentChar < '0' || currentChar > '9')) {
//       break;
//     }
//     valueEnd++;
//   }

//   if (valueStart >= rawData.length() || valueEnd <= valueStart) {
//     return -1.0;
//   }
//   return rawData.substring(valueStart, valueEnd).toFloat();
// }

// point normalizedToRobotRelativePoint(float x, float y) {
//   if (x < 0.0 || y < 0.0) {
//     return {invalidTrackingCoordinateMM, invalidTrackingCoordinateMM};
//   }

//   return {
//     normalizedToRobotRelativeX(x),
//     normalizedToRobotRelativeY(y) + cameraToRobotCenterMM
//   };
// }

// bool isDetectedPoint(point coordinate) {
//   return coordinate.x > invalidTrackingCoordinateMM / 2.0 && coordinate.y > invalidTrackingCoordinateMM / 2.0;
// }

// bool isDuplicateTrackedPoint(std::vector<point>* coordinates, point candidate) {
//   const float duplicateToleranceMM = 5.0;
//   for (int i = 0; i < (int)coordinates->size(); i++) {
//     point existing = coordinates->at(i);
//     if (!isDetectedPoint(existing)) {
//       continue;
//     }
//     float xDifference = existing.x > candidate.x ? existing.x - candidate.x : candidate.x - existing.x;
//     float yDifference = existing.y > candidate.y ? existing.y - candidate.y : candidate.y - existing.y;
//     if (xDifference <= duplicateToleranceMM && yDifference <= duplicateToleranceMM) {
//       return true;
//     }
//   }
//   return false;
// }

// std::array<point, 5> getCurrentOrderedCoordinateArray() {
//   // It should order it in the order y4, y3, cy, y2, y1
//   // AKA x4, x3, cx, x2, x1
//   // It should take the values directly from the bluetooth, i think the updateVisionArray does this but it shouldn't use that function
//   // the bluetooth gives normalized coordinates relative to the camera FOV with 0,0 being the top left and 1,1 being the bottom right
//   // if the normalized coordinate says -1 then it isn't detecting a crack
//   // you have to convert the coordinates to robot relative and in MM, there is already logic that does this like float normalizedToRobotRelativeX(float x) and functions around that area
//   std::array<point, 5> points = {{{invalidTrackingCoordinateMM, invalidTrackingCoordinateMM}, {invalidTrackingCoordinateMM, invalidTrackingCoordinateMM}, {invalidTrackingCoordinateMM, invalidTrackingCoordinateMM}, {invalidTrackingCoordinateMM, invalidTrackingCoordinateMM}, {invalidTrackingCoordinateMM, invalidTrackingCoordinateMM}}};
//   if (BS.available() <= 0) {
//     return points;
//   }

//   String rawData = BS.readStringUntil('\n');
//   rawData.trim();
//   if (rawData.length() == 0) {
//     return points;
//   }

//   points[0] = normalizedToRobotRelativePoint(parseVisionCoordinate(rawData, "x4"), parseVisionCoordinate(rawData, "y4"));
//   points[1] = normalizedToRobotRelativePoint(parseVisionCoordinate(rawData, "x3"), parseVisionCoordinate(rawData, "y3"));
//   points[2] = normalizedToRobotRelativePoint(parseVisionCoordinate(rawData, "cx"), parseVisionCoordinate(rawData, "cy"));
//   points[3] = normalizedToRobotRelativePoint(parseVisionCoordinate(rawData, "x2"), parseVisionCoordinate(rawData, "y2"));
//   points[4] = normalizedToRobotRelativePoint(parseVisionCoordinate(rawData, "x1"), parseVisionCoordinate(rawData, "y1"));

//   Serial.print("[TRACK VISION RAW] ");
//   Serial.println(rawData);
//   for (int i = 0; i < (int)points.size(); i++) {
//     Serial.print("[TRACK VISION POINT] index=");
//     Serial.print(i);
//     Serial.print(" x=");
//     Serial.print(points[i].x);
//     Serial.print(" y=");
//     Serial.println(points[i].y);
//   }
//   return points;
// }

// // This function will drive the robot forwards once the robot is already aligned with the crack
// // it will stop once the crack is no longer detected AND the robot has fully filled the last detected crack
// bool driveForwardsAndTrackCrack() {
//   std::vector<point> coordinates;
//   const int numberOfLoops = 40;
//   const float filledPointToleranceMM = 8.0;
//   bool hasSeenCrack = false;

//   Serial.println("[TRACK] start");

//   for (int i = 0; i < numberOfLoops; i++) {
//     std::array<point, 5> currentPoints = getCurrentOrderedCoordinateArray();
//     bool detectedCrackThisLoop = false;
//     int newPointsThisLoop = 0;

//     for (int j = 0; j < (int)currentPoints.size(); j++) {
//       point currentPoint = currentPoints[j];
//       if (!isDetectedPoint(currentPoint)) {
//         continue;
//       }
//       detectedCrackThisLoop = true;
//       hasSeenCrack = true;
//       if (!isDuplicateTrackedPoint(&coordinates, currentPoint)) {
//         coordinates.push_back(currentPoint);
//         newPointsThisLoop++;
//       }
//     }

//     Serial.print("[TRACK] loop=");
//     Serial.print(i);
//     Serial.print(" detected=");
//     Serial.print(detectedCrackThisLoop);
//     Serial.print(" newPoints=");
//     Serial.print(newPointsThisLoop);
//     Serial.print(" queued=");
//     Serial.println((int)coordinates.size());
//     // for (int j = 0; j < (int)coordinates.size(); j++) {
//     //   Serial.print("[TRACK QUEUE] index=");
//     //   Serial.print(j);
//     //   Serial.print(" x=");
//     //   Serial.print(coordinates[j].x);
//     //   Serial.print(" y=");
//     //   Serial.println(coordinates[j].y);
//     // }

//     int targetIndex = -1;
//     float shortestDistanceToGantry = 1000000.0;
//     for (int j = 0; j < (int)coordinates.size(); j++) {
//       float distanceToGantry = coordinates[j].y - gantryY_MM;
//       if (distanceToGantry >= -filledPointToleranceMM && distanceToGantry < shortestDistanceToGantry) {
//         shortestDistanceToGantry = max(0.0f, distanceToGantry);
//         targetIndex = j;
//       }
//     }

//     if (targetIndex < 0) {
//       for (int j = (int)coordinates.size() - 1; j >= 0; j--) {
//         if (coordinates[j].y <= gantryY_MM + filledPointToleranceMM) {
//           coordinates.erase(coordinates.begin() + j);
//         }
//       }
//       if (!detectedCrackThisLoop && coordinates.empty()) {
//         stopAllDriveMotors();
//         stopGantry();
//         Serial.print("[TRACK] done; hasSeenCrack=");
//         Serial.println(hasSeenCrack);
//         return hasSeenCrack;
//       }
//       Serial.println("[TRACK] no usable target yet");
//       delay(20);
//       continue;
//     }

