GHP-63-ECE/ARCS/ARCS-ESP32/src/main.cpp
//     Serial.print("[TRACK] targetIndex=");
//     Serial.print(targetIndex);
//     Serial.print(" targetX=");
//     Serial.print(coordinates[targetIndex].x);
//     Serial.print(" targetY=");
//     Serial.print(coordinates[targetIndex].y);
//     Serial.print(" distanceToGantry=");
//     Serial.println(shortestDistanceToGantry);

//     if (shortestDistanceToGantry > cameraFOVHeightMM) {
//       Serial.print("[TRACK] strideForwardMM=");
//       Serial.println(cameraFOVHeightMM);
//       driveForwardsAndUpdateCoordinates(cameraFOVHeightMM, &coordinates, invalidTrackingCoordinateMM);
//     } else {
//       Serial.print("[TRACK] moveToPointMM=");
//       Serial.print(shortestDistanceToGantry);
//       Serial.print(" gantryTargetX=");
//       Serial.println(coordinates[targetIndex].x);
//       driveForwardsAndUpdateCoordinates(shortestDistanceToGantry, &coordinates, coordinates[targetIndex].x);
//       setExtruderPositionTicks(fixedExtrudeTicks, pwrExt);
//     }

//     for (int j = (int)coordinates.size() - 1; j >= 0; j--) {
//       if (coordinates[j].y <= gantryY_MM + filledPointToleranceMM) {
//         coordinates.erase(coordinates.begin() + j);
//       }
//     }

//     if (!detectedCrackThisLoop && coordinates.empty()) {
//       stopAllDriveMotors();
//       stopGantry();
//       Serial.println("[TRACK] done; all queued points filled");
//       return true;
//     }
//   }

//   stopAllDriveMotors();
//   stopGantry();
//   Serial.println("[TRACK] stopped after max loops");
//   return false;
// }

// // This function drives forwards a certain distance and then updates the coordinates so that the y value reduces by the amount the robot moved forwards
// // if gantry target has a value then it will also move the gantry to its target position
// // the gantryTarget variable will be given as a robot relative x value in MM
// // use the runToEncoderTargetsWithGantry() function
// void driveForwardsAndUpdateCoordinates(float distance, std::vector<point>* coordinates, float gantryTarget) {
//   long gantryTargetTicks = 0;
//   bool movingGantry = false;
//   if (gantryTarget >= minGantryX_MM && gantryTarget <= maxGantryX_MM) {
//     long absoluteGantryTargetTicks = lround((gantryTarget - minGantryX_MM) * gantryTicksPerMM);
//     gantryTargetTicks = absoluteGantryTargetTicks - readEncoderGantry();
//     movingGantry = true;
//   }

//   long driveTargetTicks = distanceToEncoderTicks(distance);
//   Serial.print("[TRACK UPDATE] distanceMM=");
//   Serial.print(distance);
//   Serial.print(" driveTicks=");
//   Serial.print(driveTargetTicks);
//   Serial.print(" movingGantry=");
//   Serial.print(movingGantry);
//   if (movingGantry) {
//     Serial.print(" gantryTargetX=");
//     Serial.print(gantryTarget);
//     Serial.print(" gantryTicks=");
//     Serial.print(gantryTargetTicks);
//   }
//   Serial.println();

//   if (!runToEncoderTargetsWithGantry(driveTargetTicks, driveTargetTicks, gantryTargetTicks, movementSpeed)) {
//     Serial.println("[TRACK UPDATE] move failed; coordinates not updated");
//     return;
//   }

//   for (int i = 0; i < (int)coordinates->size(); i++) {
//     coordinates->at(i).y -= distance;
//   }
//   Serial.print("[TRACK UPDATE] coordinates advanced; queued=");
//   Serial.println((int)coordinates->size());
// }
